#pragma once
#include "util.h"


struct SkillsTxt //size 0x23C
{
	uint32_t				wSkillId; 				//0x00
	struct
	{
		uint8_t				bDecquant : 1;			//0
		uint8_t				bLob : 1;				//1
		uint8_t				bProgressive : 1;		//2
		uint8_t				bFinishing : 1;			//3
		uint8_t				bPassive : 1;			//4
		uint8_t				bAura : 1;				//5
		uint8_t				bPeriodic : 1;			//6
		uint8_t				bPrgStack : 1;			//7
		uint8_t				bInTown : 1;			//8
		uint8_t				bKick : 1;				//9
		uint8_t				bInGame : 1;			//10
		uint8_t				bRepeat : 1;			//11
		uint8_t				bStSuccessOnly : 1;		//12
		uint8_t				bStSoundDelay : 1;		//13
		uint8_t				bWeaponSnd : 1;			//14
		uint8_t				bImmediate : 1;			//15
		uint8_t				bNoAmmo : 1;			//16
		uint8_t				bEnhanceable : 1;		//17
		uint8_t				bDurability : 1;		//18
		uint8_t				bUseAttackRating : 1;	//19
		uint8_t				bTargetableOnly : 1;	//20
		uint8_t				bSearchEnemyXY : 1;		//21
		uint8_t				bSearchEnemyNear : 1;	//22
		uint8_t				bSearchOpenXY : 1;		//23
		uint8_t				bTargetCorpse : 1;		//24
		uint8_t				bTargetPet : 1;			//25
		uint8_t				bTargetAlly : 1;		//26
		uint8_t				bTargetItem : 1;		//27
		uint8_t				bAttackNoMana : 1;		//28
		uint8_t				bItemTgtDo : 1;			//29
		uint8_t				bLeftSkill : 1;			//30
		uint8_t				bInterrupt : 1;			//31
		uint8_t				bTgtPlaceCheck : 1;		//32
		uint8_t				bItemCheckStart : 1;	//33
		uint8_t				bItemCltCheckStart : 1;	//34
		uint8_t				bGeneral : 1;			//35
		uint8_t				bScroll : 1;			//36
		uint8_t				bUseManaOnDo : 1;		//37
		uint8_t				bWarp : 1;				//38
	} dwFlags;										//0x04 (5 uint8_ts)
	uint32_t				bClassId;				//0x0C
	uint8_t					bAnim;					//0x10
	uint8_t					bMonAnim;				//0x11
	uint8_t					bSeqTrans;				//0x12
	uint8_t					bSeqNum;				//0x13
	uint8_t					bRange;					//0x14
	uint8_t					bSelectProc;			//0x15
	uint8_t					bSeqInput;				//0x16
	uint8_t					_1;						//0x17
	uint16_t				wITypeA1;				//0x18
	uint16_t				wITypeA2;				//0x1A
	uint16_t				wITypeA3;				//0x1C
	uint16_t				wITypeB1;				//0x1E
	uint16_t				wITypeB2;				//0x20
	uint16_t				wITypeB3;				//0x22
	uint16_t				wETypeA1;				//0x24
	uint16_t				wETypeA2;				//0x26
	uint16_t				wETypeB1;				//0x28
	uint16_t				wETypeB2;				//0x2A
	uint16_t				wSrvStartFunc;			//0x2C
	uint16_t				wSrvDoFunc;				//0x2E
	uint16_t				wSrvPrgFunc1;			//0x30
	uint16_t				wSrvPrgFunc2;			//0x32
	uint16_t				wSrvPrgFunc3;			//0x34
	uint16_t				_2;						//0x36
	uint32_t				dwPrgCalc1;				//0x38
	uint32_t				dwPrgCalc2;				//0x3C
	uint32_t				dwPrgCalc3;				//0x40
	uint16_t				bPrgDamage;				//0x44
	uint16_t				wSrvMissile;			//0x46
	uint16_t				wSrvMissileA;			//0x48
	uint16_t				wSrvMissileB;			//0x4A
	uint16_t				wSrvMissileC;			//0x4C
	uint16_t				wSrvOverlay;			//0x4E
	uint32_t				dwAuraFilter;			//0x50
	uint16_t				wAuraStat1;				//0x54
	uint16_t				wAuraStat2;				//0x56
	uint16_t				wAuraStat3;				//0x58
	uint16_t				wAuraStat4;				//0x5A
	uint16_t				wAuraStat5;				//0x5C
	uint16_t				wAuraStat6;				//0x5E
	uint32_t				dwAuraLenCalc;			//0x60
	uint32_t				dwAuraRangeCalc;		//0x64
	uint32_t				dwAuraStatCalc1;		//0x68
	uint32_t				dwAuraStatCalc2;		//0x6C
	uint32_t				dwAuraStatCalc3;		//0x70
	uint32_t				dwAuraStatCalc4;		//0x74
	uint32_t				dwAuraStatCalc5;		//0x78
	uint32_t				dwAuraStatCalc6;		//0x7C
	uint16_t				wAuraState;				//0x80
	uint16_t				wAuraTargetState;		//0x82
	uint16_t				wAuraEvent1;			//0x84
	uint16_t				wAuraEvent2;			//0x86
	uint16_t				wAuraEvent3;			//0x88
	uint16_t				wAuraEventFunc1;		//0x8A
	uint16_t				wAuraEventFunc2;		//0x8C
	uint16_t				wAuraEventFunc3;		//0x8E
	uint16_t				wAuraTgtEvent;			//0x90
	uint16_t				wAuraTgtEventFunc;		//0x92
	uint16_t				wPassiveState;			//0x94
	uint16_t				wPassiveiType;			//0x96
	uint16_t				wPassiveStat1;			//0x98
	uint16_t				wPassiveStat2;			//0x9A
	uint16_t				wPassiveStat3;			//0x9C
	uint16_t				wPassiveStat4;			//0x9E
	uint16_t				wPassiveStat5;			//0xA0
	uint16_t				_3;						//0xA2
	uint32_t				dwPassiveCalc1;			//0xA4
	uint32_t				dwPassiveCalc2;			//0xA8
	uint32_t				dwPassiveCalc3;			//0xAC
	uint32_t				dwPassiveCalc4;			//0xB0
	uint32_t				dwPassiveCalc5;			//0xB4
	uint16_t				wPassiveEvent;			//0xB8
	uint16_t				wPassiveEventFunc;		//0xBA
	uint16_t				wSummon;				//0xBC
	uint8_t					wPetType;				//0xBE
	uint8_t					bSumMode;				//0xBF
	uint32_t				dwPetMax;				//0xC0
	uint16_t				wSumSkill1;				//0xC4
	uint16_t				wSumSkill2;				//0xC6
	uint16_t				wSumSkill3;				//0xC8
	uint16_t				wSumSkill4;				//0xCA
	uint16_t				wSumSkill5;				//0xCC
	uint16_t				_4;						//0xCE
	uint32_t				dwSumSkCalc1;			//0xD0
	uint32_t				dwSumSkCalc2;			//0xD4
	uint32_t				dwSumSkCalc3;			//0xD8
	uint32_t				dwSumSkCalc4;			//0xDC
	uint32_t				dwSumSkCalc5;			//0xE0
	uint16_t				wSumUMod;				//0xE4
	uint16_t				wSumOverlay;			//0xE6
	uint16_t				wCltMissile;			//0xE8
	uint16_t				wCltMissileA;			//0xEA
	uint16_t				wCltMissileB;			//0xEC
	uint16_t				wCltMissileC;			//0xEE
	uint16_t				wCltMissileD;			//0xF0
	uint16_t				wCltStFunc;				//0xF2
	uint16_t				wCltDoFunc;				//0xF4
	uint16_t				wCltPrgFunc1;			//0xF6
	uint16_t				wCltPrgFunc2;			//0xF8
	uint16_t				wCltPrgFunc3;			//0xFA
	uint16_t				wStSound;				//0xFC
	uint16_t				_5;						//0xFE
	uint16_t				wDoSound;				//0x100
	uint16_t				wDoSoundA;				//0x102
	uint16_t				wDoSoundB;				//0x104
	uint16_t				wCastOverlay;			//0x106
	uint16_t				wTgtOverlay;			//0x108
	uint16_t				wTgtSound;				//0x10A
	uint16_t				wPrgOverlay;			//0x10C
	uint16_t				wPrgSound;				//0x10E
	uint16_t				wCltOverlayA;			//0x110
	uint16_t				wCltOverlayB;			//0x112
	uint32_t				dwCltCalc1;				//0x114
	uint32_t				dwCltCalc2;				//0x118
	uint32_t				dwCltCalc3;				//0x11C
	uint16_t				bItemTarget;			//0x120
	uint16_t				wItemCastSound;			//0x122
	uint32_t				wItemCastOverlay;		//0x124
	uint32_t				dwPerDelay;				//0x128
	uint16_t				wMaxLvl;				//0x12C
	uint16_t				wResultFlags;			//0x12E
	uint32_t				dwHitFlags;				//0x130
	uint32_t				dwHitClass;				//0x134
	uint32_t				dwCalc1;				//0x138
	uint32_t				dwCalc2;				//0x13C
	uint32_t				dwCalc3;				//0x140
	uint32_t				dwCalc4;				//0x144
	uint32_t				dwParam1;				//0x148
	uint32_t				dwParam2;				//0x14C
	uint32_t				dwParam3;				//0x150
	uint32_t				dwParam4;				//0x154
	uint32_t				dwParam5;				//0x158
	uint32_t				dwParam6;				//0x15C
	uint32_t				dwParam7;				//0x160
	uint32_t				dwParam8;				//0x164
	uint16_t				bWeapSel;				//0x168
	uint16_t				wItemEffect;			//0x16A
	uint32_t				wItemCltEffect;			//0x16C
	uint32_t				dwSkPoints;				//0x170
	uint16_t				wReqLevel;				//0x174
	uint16_t				wReqStr;				//0x176
	uint16_t				wReqDex;				//0x178
	uint16_t				wReqInt;				//0x17A
	uint16_t				wReqVit;				//0x17C
	uint16_t				wReqSkill1;				//0x17E
	uint16_t				wReqSkill2;				//0x180
	uint16_t				wReqSkill3;				//0x182
	uint16_t				wStartMana;				//0x184
	uint16_t				wMinMana;				//0x186
	uint16_t				wManaShift;				//0x188
	uint16_t				wMana;					//0x18A
	uint16_t				wLevelMana;				//0x18C
	uint8_t					bAttackRank;			//0x18E
	uint8_t					bLineOfSight;			//0x18F
	uint32_t				dwDelay;				//0x190
	uint32_t				wSkillDesc;				//0x194
	uint32_t				dwToHit;				//0x198
	uint32_t				dwLevToHit;				//0x19C
	uint32_t				dwToHitCalc;			//0x1A0
	uint8_t					bToHitShift;			//0x1A4
	uint8_t					bSrcDam;				//0x1A5
	uint16_t				_6;						//0x1A6
	uint32_t				dwMinDam;				//0x1A8
	uint32_t				dwMaxDam;				//0x1AC
	uint32_t				dwMinLvlDam1;			//0x1B0
	uint32_t				dwMinLvlDam2;			//0x1B4
	uint32_t				dwMinLvlDam3;			//0x1B8
	uint32_t				dwMinLvlDam4;			//0x1BC
	uint32_t				dwMinLvlDam5;			//0x1C0
	uint32_t				dwMaxLvlDam1;			//0x1C4
	uint32_t				dwMaxLvlDam2;			//0x1C8
	uint32_t				dwMaxLvlDam3;			//0x1CC
	uint32_t				dwMaxLvlDam4;			//0x1D0
	uint32_t				dwMaxLvlDam5;			//0x1D4
	uint32_t				dwDmgSymPerCalc;		//0x1D8
	uint16_t				bEType;					//0x1DC
	uint16_t				_7;						//0x1DE
	uint32_t				dwEMin;					//0x1E0
	uint32_t				dwEMax;					//0x1E4
	uint32_t				dwEMinLev1;				//0x1E8
	uint32_t				dwEMinLev2;				//0x1EC
	uint32_t				dwEMinLev3;				//0x1F0
	uint32_t				dwEMinLev4;				//0x1F4
	uint32_t				dwEMinLev5;				//0x1F8
	uint32_t				dwEMaxLev1;				//0x1FC
	uint32_t				dwEMaxLev2;				//0x200
	uint32_t				dwEMaxLev3;				//0x204
	uint32_t				dwEMaxLev4;				//0x208
	uint32_t				dwEMaxLev5;				//0x20C
	uint32_t				dwEDmgSymPerCalc;		//0x210
	uint32_t				dwELen;					//0x214
	uint32_t				dwELevLen1;				//0x218
	uint32_t				dwELevLen2;				//0x21C
	uint32_t				dwELevLen3;				//0x220
	uint32_t				dwELenSymPerCalc;		//0x224
	uint16_t				bRestrict;				//0x228
	uint16_t				wState1;				//0x22A
	uint16_t				wState2;				//0x22C
	uint16_t				wState3;				//0x22E
	uint16_t				bAiType;				//0x230
	uint16_t				wAiBonus;				//0x232
	uint32_t				dwCostMult;				//0x234
	uint32_t				dwCostAdd;				//0x238
};


std::string UnpackSkills(char* data, size_t fileSize)
{
	std::stringstream stream;
	int amountRows = 0;
	memcpy(&amountRows, data, sizeof(int));

	if (fileSize - 4 != (sizeof(SkillsTxt) * amountRows))
	{
		std::cout << "Data size doesnt match amount of items! Wanted: " << sizeof(SkillsTxt) * amountRows << "  Got: " << fileSize - 4 << std::endl;
		PauseExit();
	}
	else
	{
		stream << "wSkillId" << '\t';
		stream << "bDecquant" << '\t';
		stream << "bLob" << '\t';
		stream << "bProgressive" << '\t';
		stream << "bFinishing" << '\t';
		stream << "bPassive" << '\t';
		stream << "bAura" << '\t';
		stream << "bPeriodic" << '\t';
		stream << "bPrgStack" << '\t';
		stream << "bInTown" << '\t';
		stream << "bKick" << '\t';
		stream << "bInGame" << '\t';
		stream << "bRepeat" << '\t';
		stream << "bStSuccessOnly" << '\t';
		stream << "bStSoundDelay" << '\t';
		stream << "bWeaponSnd" << '\t';
